#ifndef __IMAGE2LCD_H
#define __IMAGE2LCD_H
#include "sys.h"	 
#include "stdlib.h"
//********************************************************************//
//! 函数名:image_display
//! 功能:在指定位置显示图片
//! 输入:x,y:指定位置; imgx:图片数据指针; 
//! 输出:none
//********************************************************************// 
extern void image_display(u16 x,u16 y,u8 * imgx);
//********************************************************************//
//! 函数名:image_show
//! 功能:在液晶上画图
//! 输入:xsta,ysta,xend,yend:画图区域; scan:扫描方向; p:图像数组指针
//! 输出:none
//********************************************************************//
void image_show(u16 xsta,u16 ysta,u16 xend,u16 yend,u8 scan,u8 *p);
//********************************************************************//
//! 函数名:image_getcolor
//! 功能:从8位数据获取16位颜色
//! 输入:mode: 0:低位在前,高位在后; 1:高位在前,低位在后; str:数据指针; 
//! 输出:16位颜色
//********************************************************************//
u16 image_getcolor(u8 mode,u8 *str);

#endif













